; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p17---int100n150-m25---int100c150---s459---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 - fuellevel
)

(:init
(sum level0 level9 level9)
(sum level0 level24 level24)
(sum level1 level9 level10)
(sum level1 level24 level25)
(sum level2 level9 level11)
(sum level2 level24 level26)
(sum level3 level9 level12)
(sum level3 level24 level27)
(sum level4 level9 level13)
(sum level4 level24 level28)
(sum level5 level9 level14)
(sum level5 level24 level29)
(sum level6 level9 level15)
(sum level6 level24 level30)
(sum level7 level9 level16)
(sum level7 level24 level31)
(sum level8 level9 level17)
(sum level8 level24 level32)
(sum level9 level9 level18)
(sum level9 level24 level33)
(sum level10 level9 level19)
(sum level10 level24 level34)
(sum level11 level9 level20)
(sum level11 level24 level35)
(sum level12 level9 level21)
(sum level12 level24 level36)
(sum level13 level9 level22)
(sum level13 level24 level37)
(sum level14 level9 level23)
(sum level14 level24 level38)
(sum level15 level9 level24)
(sum level15 level24 level39)
(sum level16 level9 level25)
(sum level16 level24 level40)
(sum level17 level9 level26)
(sum level17 level24 level41)
(sum level18 level9 level27)
(sum level18 level24 level42)
(sum level19 level9 level28)
(sum level19 level24 level43)
(sum level20 level9 level29)
(sum level20 level24 level44)
(sum level21 level9 level30)
(sum level21 level24 level45)
(sum level22 level9 level31)
(sum level22 level24 level46)
(sum level23 level9 level32)
(sum level23 level24 level47)
(sum level24 level9 level33)
(sum level24 level24 level48)
(sum level25 level9 level34)
(sum level25 level24 level49)
(sum level26 level9 level35)
(sum level26 level24 level50)
(sum level27 level9 level36)
(sum level27 level24 level51)
(sum level28 level9 level37)
(sum level28 level24 level52)
(sum level29 level9 level38)
(sum level29 level24 level53)
(sum level30 level9 level39)
(sum level30 level24 level54)
(sum level31 level9 level40)
(sum level31 level24 level55)
(sum level32 level9 level41)
(sum level32 level24 level56)
(sum level33 level9 level42)
(sum level33 level24 level57)
(sum level34 level9 level43)
(sum level34 level24 level58)
(sum level35 level9 level44)
(sum level35 level24 level59)
(sum level36 level9 level45)
(sum level36 level24 level60)
(sum level37 level9 level46)
(sum level37 level24 level61)
(sum level38 level9 level47)
(sum level38 level24 level62)
(sum level39 level9 level48)
(sum level39 level24 level63)
(sum level40 level9 level49)
(sum level40 level24 level64)
(sum level41 level9 level50)
(sum level41 level24 level65)
(sum level42 level9 level51)
(sum level42 level24 level66)
(sum level43 level9 level52)
(sum level43 level24 level67)
(sum level44 level9 level53)
(sum level44 level24 level68)
(sum level45 level9 level54)
(sum level45 level24 level69)
(sum level46 level9 level55)
(sum level46 level24 level70)
(sum level47 level9 level56)
(sum level47 level24 level71)
(sum level48 level9 level57)
(sum level48 level24 level72)
(sum level49 level9 level58)
(sum level49 level24 level73)
(sum level50 level9 level59)
(sum level50 level24 level74)
(sum level51 level9 level60)
(sum level51 level24 level75)
(sum level52 level9 level61)
(sum level52 level24 level76)
(sum level53 level9 level62)
(sum level53 level24 level77)
(sum level54 level9 level63)
(sum level54 level24 level78)
(sum level55 level9 level64)
(sum level55 level24 level79)
(sum level56 level9 level65)
(sum level56 level24 level80)
(sum level57 level9 level66)
(sum level57 level24 level81)
(sum level58 level9 level67)
(sum level58 level24 level82)
(sum level59 level9 level68)
(sum level59 level24 level83)
(sum level60 level9 level69)
(sum level60 level24 level84)
(sum level61 level9 level70)
(sum level61 level24 level85)
(sum level62 level9 level71)
(sum level62 level24 level86)
(sum level63 level9 level72)
(sum level63 level24 level87)
(sum level64 level9 level73)
(sum level64 level24 level88)
(sum level65 level9 level74)
(sum level65 level24 level89)
(sum level66 level9 level75)
(sum level66 level24 level90)
(sum level67 level9 level76)
(sum level67 level24 level91)
(sum level68 level9 level77)
(sum level68 level24 level92)
(sum level69 level9 level78)
(sum level69 level24 level93)
(sum level70 level9 level79)
(sum level70 level24 level94)
(sum level71 level9 level80)
(sum level71 level24 level95)
(sum level72 level9 level81)
(sum level72 level24 level96)
(sum level73 level9 level82)
(sum level73 level24 level97)
(sum level74 level9 level83)
(sum level74 level24 level98)
(sum level75 level9 level84)
(sum level75 level24 level99)
(sum level76 level9 level85)
(sum level77 level9 level86)
(sum level78 level9 level87)
(sum level79 level9 level88)
(sum level80 level9 level89)
(sum level81 level9 level90)
(sum level82 level9 level91)
(sum level83 level9 level92)
(sum level84 level9 level93)
(sum level85 level9 level94)
(sum level86 level9 level95)
(sum level87 level9 level96)
(sum level88 level9 level97)
(sum level89 level9 level98)
(sum level90 level9 level99)

(connected l0 l1)
(fuelcost level24 l0 l1)
(connected l0 l2)
(fuelcost level9 l0 l2)
(connected l1 l0)
(fuelcost level24 l1 l0)
(connected l1 l2)
(fuelcost level24 l1 l2)
(connected l2 l0)
(fuelcost level9 l2 l0)
(connected l2 l1)
(fuelcost level24 l2 l1)

(at t0 l2)
(fuel t0 level99)
(= (total-cost) 0)

(at p0 l0)
(at p1 l1)
(at p2 l1)
(at p3 l0)
(at p4 l2)
(at p5 l0)
(at p6 l0)
(at p7 l2)
(at p8 l0)
(at p9 l2)
(at p10 l0)
(at p11 l0)
(at p12 l1)
(at p13 l0)
(at p14 l1)
(at p15 l1)
(at p16 l0)
)

(:goal
(and
(at p0 l2)
(at p1 l2)
(at p2 l0)
(at p3 l2)
(at p4 l1)
(at p5 l2)
(at p6 l1)
(at p7 l0)
(at p8 l1)
(at p9 l1)
(at p10 l1)
(at p11 l2)
(at p12 l2)
(at p13 l1)
(at p14 l0)
(at p15 l2)
(at p16 l2)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l2)
   deleted: (at p9 l2)
   added: (in p9 t0)
   goals met: 0 of 17
2. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 0 of 17
3. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 17
4. (drive t0 l2 l0 level90 level9 level99)
   deleted: (at t0 l2) (fuel t0 level99)
   added: (at t0 l0) (fuel t0 level90)
   goals met: 0 of 17
5. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 0 of 17
6. (load p6 t0 l0)
   deleted: (at p6 l0)
   added: (in p6 t0)
   goals met: 0 of 17
7. (load p5 t0 l0)
   deleted: (at p5 l0)
   added: (in p5 t0)
   goals met: 0 of 17
8. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 0 of 17
9. (load p16 t0 l0)
   deleted: (at p16 l0)
   added: (in p16 t0)
   goals met: 0 of 17
10. (load p13 t0 l0)
   deleted: (at p13 l0)
   added: (in p13 t0)
   goals met: 0 of 17
11. (load p11 t0 l0)
   deleted: (at p11 l0)
   added: (in p11 t0)
   goals met: 0 of 17
12. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 0 of 17
13. (load p0 t0 l0)
   deleted: (at p0 l0)
   added: (in p0 t0)
   goals met: 0 of 17
14. (drive t0 l0 l1 level66 level24 level90)
   deleted: (at t0 l0) (fuel t0 level90)
   added: (at t0 l1) (fuel t0 level66)
   goals met: 0 of 17
15. (unload p9 t0 l1)
   deleted: (in p9 t0)
   added: (at p9 l1)
   goals met: 1 of 17
16. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 2 of 17
17. (unload p6 t0 l1)
   deleted: (in p6 t0)
   added: (at p6 l1)
   goals met: 3 of 17
18. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 4 of 17
19. (unload p13 t0 l1)
   deleted: (in p13 t0)
   added: (at p13 l1)
   goals met: 5 of 17
20. (unload p10 t0 l1)
   deleted: (in p10 t0)
   added: (at p10 l1)
   goals met: 6 of 17
21. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 6 of 17
22. (load p15 t0 l1)
   deleted: (at p15 l1)
   added: (in p15 t0)
   goals met: 6 of 17
23. (load p14 t0 l1)
   deleted: (at p14 l1)
   added: (in p14 t0)
   goals met: 6 of 17
24. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 6 of 17
25. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 6 of 17
26. (drive t0 l1 l0 level42 level24 level66)
   deleted: (at t0 l1) (fuel t0 level66)
   added: (at t0 l0) (fuel t0 level42)
   goals met: 6 of 17
27. (unload p14 t0 l0)
   deleted: (in p14 t0)
   added: (at p14 l0)
   goals met: 7 of 17
28. (unload p2 t0 l0)
   deleted: (in p2 t0)
   added: (at p2 l0)
   goals met: 8 of 17
29. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 9 of 17
30. (drive t0 l0 l2 level33 level9 level42)
   deleted: (at t0 l0) (fuel t0 level42)
   added: (at t0 l2) (fuel t0 level33)
   goals met: 9 of 17
31. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 10 of 17
32. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 11 of 17
33. (unload p11 t0 l2)
   deleted: (in p11 t0)
   added: (at p11 l2)
   goals met: 12 of 17
34. (unload p12 t0 l2)
   deleted: (in p12 t0)
   added: (at p12 l2)
   goals met: 13 of 17
35. (unload p15 t0 l2)
   deleted: (in p15 t0)
   added: (at p15 l2)
   goals met: 14 of 17
36. (unload p16 t0 l2)
   deleted: (in p16 t0)
   added: (at p16 l2)
   goals met: 15 of 17
37. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 16 of 17
38. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 17 of 17
